# Import Modules

In [4]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [6]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size = (n_rows, n_cols)),
                  columns = cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df

   bil_pecahan  bil_bulat
0          7.0         14
1          8.0          3
2          5.0          2
3         19.0         11
4         16.0         15

In [8]:
df.index = pd.date_range(start='2023-10-01', periods=n_rows, freq='h')
df=df.reset_index()
df['teks']=list('ABCDE')
df

                index  bil_pecahan  bil_bulat teks
0 2023-10-01 00:00:00          7.0         14    A
1 2023-10-01 01:00:00          8.0          3    B
2 2023-10-01 02:00:00          5.0          2    C
3 2023-10-01 03:00:00         19.0         11    D
4 2023-10-01 04:00:00         16.0         15    E

In [77]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

# Memilih Kolom Bertipe Data Numerik

In [75]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         15.0         19
1         15.0          1
2          3.0         13
3         18.0         17
4          4.0         16

In [67]:
df.select_dtypes(include='float')

   bil_pecahan
0         15.0
1         15.0
2          3.0
3         18.0
4          4.0

In [69]:
df.select_dtypes(include='int')

   bil_bulat
0         19
1          1
2         13
3         17
4         16

# Memilih Kolom Bertipe Data String atau Object

In [79]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

# Memilih Kolom Bertipe Data Datetime

In [81]:
df.select_dtypes(include='datetime')

                index
0 2023-10-01 00:00:00
1 2023-10-01 01:00:00
2 2023-10-01 02:00:00
3 2023-10-01 03:00:00
4 2023-10-01 04:00:00

# Memilih Kolom Dengan Kombinasi Tipedata

In [83]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         15.0         19    A
1         15.0          1    B
2          3.0         13    C
3         18.0         17    D
4          4.0         16    E